---
kind: method
id: M:Autodesk.Revit.DB.ReferenceWithContext.GetReference
source: html/a430c4b9-9a9b-b16a-b97a-fe8510d3e38d.htm
---
# Autodesk.Revit.DB.ReferenceWithContext.GetReference Method

Gets the reference of the geometric object.

## Syntax (C#)
```csharp
public Reference GetReference()
```

## Returns
The reference of a geometric object when it is returned by FindReferencesWithContextByDirection(XYZ, XYZ, View3D) or ReferenceIntersector.Find(XYZ, XYZ).